title: Sample Splunk Alert 1
id: 
description: This is a cool sample rule
date: 01/02/2020
modified: 01/02/2020
author: Olindo Verrillo
references:
    - PLACEHOLDER
tags:
    - attack.execution
    - attack.t1203
logsource:
    product: antivirus
configuration:
    action.email: 1
    action.email.inline: 1
    action.email.sendresults: 1
    action.email.to: olindo.verrillo@gmail.com
    action.email.useNSSubject: 1
    alert.digest_mode: True
    alert.suppress: 0
    alert.track: 0
    auto_summarize.dispatch.earliest_time: -1d@h
    counttype: number of events
    cron_schedule: '*/30 * * * *'
    description: This is a test of the detector
    dispatch.earliest_time: -30m
    dispatch.latest_time: now
    display.general.type: statistics
    display.page.search.mode: verbose
    display.page.search.tab: statistics
    enableSched: 1
    quantity: 0
    relation: greater than
    request.ui_dispatch_app: search
    request.ui_dispatch_view: search
    search: 
        - "index=wineventlog EventCode:4625 | table ComputerName, Account_Name, signature"
fields:
    - FileName
    - User
falsepositives:
    - Unlikely
level: critical
